import Zod, { ZodError, ZodType, z } from "zod";

const WissataTypeSchema = z.object({
  wizara: z.string(),
  institution: z.array(
    z.object({
      name: z.string(),
      mawdo3: z.array(
        z.object({
          naw3arida: z.string(),
          mawdo3s: z.array(z.string()),
        })
      ),
    })
  ),
});
const DairaTypeSchema = z.object({
  name: z.string(),
  baladiya: z.array(z.string()),
});
interface WissataType extends Zod.infer<typeof WissataTypeSchema> {}
interface DairaType extends Zod.infer<typeof DairaTypeSchema> {}
interface TasksType extends Zod.infer<typeof tasksTypeSchema> {}

const WissataTypeSchemadata: WissataType[] = [
  {
    wizara: "الوزارة الأولى",
    institution: [
      {
        name: "المديرية العامة للوظيفة العمومية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "المعادلة الإدارية للشهادات",
              "المسابقات والامتحانات الخاصة بالتوظيف",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "مجموع الوكالة الوطنية لترقية الإستثمار ( AAPI )",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "منح الإمتيازات الجبائية و الشبه جبائية",
              "تمديد فترة الإمتياز",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "اخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة الشؤون الخارجية والجالية الوطنية بالخارج",
    institution: [
      {
        name: "مجموع المصالح المركزية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "استخراج وثائق الحالة المدنية و البيومترية",
              "اجلاء مواطنين من الخارج",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "أخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة الداخلية والجماعات المحلية والتهيئة العمرانية",
    institution: [
      {
        name: "  الولاية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "عقود الملكية ",
              "السكن العمومي الايجاري",
              "تسوية وضعية مهنية ",
              "االتلاعب بمحضر قرعة الحج",
              "شهادة المطابقة لانجاز مشروع استثماري ",
              "عدم احترام معايير عملية توتيد الابار الارتوازية",
              "طلب رخصة استغلال الرمل ",
              "شكوى ضد منتخب  بسب سوء تسييرة البلدية ",
              " حل مشكلة الانسداد الحاصل في المجلس البلدي ",
              "طلب مقر  لجمعية ",
              "تسوية وضعية التجزئات السكنية",
              "معارضة قرار هدم ",
              "طلب  تسوية وضعية كشك ",
              "طلب تمديد رخصة استغلال استخراج الرمل ",
              "طلب تقليص المساحة الاحتياطية لحقل الرمي العسكري ",
              "طلب مقابلة السيد الوالي ",
              "طلب تغير صفة النشاط من شخص طبيعي الى معنوي ",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["الانشغالات التنموية", "اخرى"],
          },
        ],
      },
      {
        name: "الدائرة",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " السكن العمومي الإيجاري",
              " السكن الترقوي المدعم",
              " محلات ذات الاستعمال المهني",
              "تسوية البنايات في اطار القانون 08/15",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              " شكوى لتعسف في استعمال السلطة ",
              " طلب منح مقررة سكن ",
              " طلب قطعة أرض تعويضية ",
              " شكوى لتهميش الجمعيات ",
              " عدم وجود منتخبين يمثلون المنطقة",
              " شكوى ضد رئيس الدائرة بسب عدم حضور  اليوم الوطني للشهيد",
              " شكوى ضد رئيس الدائرة",
              " طلب الحصول على محافظ مدرسية",
              " شكوى ضد منتخب ",
              " أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "البلدية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تنظيم و تسيير الأسواق الأسبوعية ",
              "استخراج البطاقة الرمادية ",
              "استخراج وثائق الحالة المدنية و البيومترية",
              "رخصة التجزئة",
              "رخصة البناء",
              "رخصة بناء لمشروع استثماري",
              "رخصة الهدم",
              "شهادة التعمير",
              "شهادة المطابقة",
              "شهادة الحيازة",
              "رخصة الاشغال على الطريق",
              "تسوية البنايات في إطار القانون 15/08",
              "إعانة البناء الريفي",
              "محلات ذات الاستعمال المهني",
              "اعتماد الجمعيات (الناشطة على مستوى البلدية)",
              "المنحة الجزافية للتضامن",
              "منحة التمدرس",
              "اعانة شهر رمضان",
              "رخص الاستغلال للأنشطة التجارية",
              "رخصة استغلال الشواطىء و مناطق الإستجمام",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "التعدي على الملكية ",
              "طلب استغلال قطة ارض ",
              "السكنات الوظيفية ",
              "طلب الحصول على مقر للجمعية ",
              "طلب تغير مكان ملعب مجاور لسكنات المواطنيين ",
              "طلب ترسيم وتوتيد الحدود الفاصلة بين ولاية المسيلة ولاية باتنه",
              "طلب للالتزام بمخطط شغل الاراضي ",
              " الحصول على شهادة ادارية تثبت النقطة الاستدلالية",
              "طلب  الحصول على نسخة من محضر المعاينة",
              "طلب توتيد  قطعة أرضية",
              "تهيئة مستثمرة فلاحية ",
              "طلب عمل ",
              "طلب الغاء شهادة استغلال لمخبزة تقع اسفل عمارة",
              "التماس المساعدة  لتجسيد مشروع متمثل في مزرعة ذكية ",
              "عريضة منتخب لعدم استدعائه في لجنة الصفقات",
              "شكوى ضد رئيس  المجلس الشعبي البلدي ",
              "طلب تجسيد مخطط شغل الاراضي",
              "التنازل عن السكنات التابعة للبلدية ",
              "تهية قطعة أرض موجهة للاستثمار ",
              "الترخيص للقيام بعملية الحرث ",
              "تسوية وضعيات مهنية ",
              "الاستفادة من العقار الفلاحي ",
              "تغير مصب قنوات الصرف الحي لانها تصب في ارض فلاحية",
              "طلب ازالة كشك ",
              "الغاء استفادة من سكنات ",
              "طلب الحصول على قطعة أرض",
              "أخطلب التعويض عن قطعة أرض رى",
              "شكوى ضد موظفة ",
              "شكاوي ضد أشخاص",
              "طلب تغير موقع تجزئة ترابية",
              "فتح تحقيق في استغلال اراضي ملك للبلدية",
              "دعم مبادرة لم الشمل ",
              "طلب تهيئة مقبرة",
              "شكوى ضد رؤساء الفروع البلدية لعدم قيامهم بوجباتهم",
              "طلب ربط فروع بلدية بالشبكة الوطنية لاستخراج الوثائق",
              "شكوى لعدم لاستفادة من التسخير في عملية الاحصاء ",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [
              "الإنارة العمومية",
              "التهيئة الحضرية",
              "انجاز ملحقات ادارية",
              "انجاز فضاءات ترفيهية",
              "الإطعام المدرسي",
              "النقل المدرسي",
              "التدفئة المدرسية",
              "فتح ممرات و مسالك",
              "جمع النفايات",
            ],
          },
        ],
      },
      {
        name: "  الوكالة الولائية للتنظيم والتسيير الحضريين",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تسوية وضعية التجزئات العقارية والسكنية",
              "تسوية وضعية المستفيدين من سكنات في اطار الترقوي المدعم او الترقوي ، التساهمي",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["التهيئة الحضرية ", "فتح الممرات والمسالك", "أخرى"],
          },
        ],
      },

      {
        name: "  المديرية الولائية للأمن الحضري ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["شكوى ضد شرطية ", "اخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  أخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة العدل ",
    institution: [
      {
        name: "مجلس القضاء",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "استخراج شهادات (السوابق العدلية – الجنسية)",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "اعادة النظر  في قرار قضائي ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: "رئيس نقابة المحامين",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "شكوى ضد محامية لعدم قيام الاخيرة بواجبها اتجاه موكلها",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "المنسق الولائي للمحضريين القضائيين ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " شكوى ضد محضر القضائي  لعدم تنفيذ حكم ممهور بالصيغة التنفيذية ",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "اخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة المالية ",
    institution: [
      {
        name: "المصالح المركزية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["الإعتمادات", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية أملاك الدولة",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "عقود الملكية ",
              "عقد الامتياز للأراضي الفلاحية",
              "عقد الامتياز لإنجاز مشروع استثماري",
              "عقود التنازل عن السكنات ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "قطعة ارضية لانجاز مشاريع استثمارية",
              "طلب تسوية ارضيات لمرقين عقارين خواص استفادو من برامج السكن الترقوي",
              "طلب لالغاء قرار وتحويل ارض فلاحية الى تجزئات اجتماعية",
              "اعادة النظر في سعر المتر مربع ",
              "اعادة تقيم سعر الكراء ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية  مسح الأراضي و الحفظ العقاري",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تحديد حدود الملكيات وضبط مساحتها والطبيعة  القانونية",
              "استخراج وثائق مسح الاراضي",
              "اصدار الدفتر العقاري",
              "استخراج شهادة السلبية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              " طلب بيان وصفي للسكن",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "مديرية الضرائب ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تسوية الوضعية الجبائية",
              "طلب تسديد القيمة المضافة التي تم الغاء العمل بها ",
              "اعادة النظر في الضريبية البيئية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "المديرية العامة للجمارك ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "جمركة السلع، العتاد، المركبات......",
              "استرجاع  مركبة محجوزة ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "أمين الخزينة العمومية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["تسوية وضعيات مالية ", "شكوى ضد موظف ", "اخرى"],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "البنوك",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "القروض الإستثمارية",
              "طلب جدولة دين ",
              "طلب الغاء غرامات التاخير",
              "الموافقة البنكية",
              " اعادة فتح حساب بنكي متوقف",
              "طلب الحصول على الاجرة الشهرية ",
              "",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "شركات التأمين",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["تسديد و تسوية المستحقات المالية للمواطنين", "اخرى"],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "اخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الطاقة والمناجم",
    institution: [
      {
        name: "   المصالح المركزية  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["الإعتمادات  ", "رخص استيراد المواد الخطيرة    ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "مديرية الطاقة والمناجم",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "   رخص اقتناء المازوت والمواد الحساسة",
              "التعويض عن نزع الملكية  ",
              "رخص استغلال المحاجر و المناجم",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "رخص  ممارسة نشاط المحروقات لزيوت المستعملة",
              "الربط بشبكة الكهرباء ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: ["الربط بشبكة الكهرباء", "الربط بشبكة الغاز ", "اخرى"],
          },
        ],
      },
      {
        name: "شركة سونلغاز",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الربط بشبكة الغاز للإستعمال المنزلي",
              "الربط بشبكة الكهرباء للإستعمال المنزلي",
              "ربط مشروع استثماري بشبكة الكهرباء والغاز",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "طلب الحصول على فواتير الكهرباء والغاز ",
              "تسوية وضعيات مالية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [
              "الربط بشبكة الغاز",
              "الربط بشبكة الكهرباء",
              "تغير مكان دفع فواتير الكهرباء",
              "اخرى",
            ],
          },
        ],
      },
      {
        name: "اخرى",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية ",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة المجاهدين وذوي الحقوق  ",
    institution: [
      {
        name: "   مديرية المجاهدين    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "منحة المجاهدين و ذوي الحقوق  ",
              "   شهادتي العضوية والعطب",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "التماس دفن رفاة الشهداء في مسقط رأسهم  ",
              "تسوية وضعية ملف ضحايا انفجار لغم من الحقبة الاستعمارية",
              "طلب الاستفادة من رخصة نقل حضري ",
              " طلبات تسمية المرافق  العمومية باسماء المجاهدين ",
              " طلبات رفع المعاش",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة التربية الوطنية",
    institution: [
      {
        name: " مديرية التربية الوطنية",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "التسجيل في القسم التحضيري",
              "إعادة السنة الدراسية",
              "تحويل من مؤسسة تربوية أخرى",
              "تغيير التوجيه المدرسي",
              "اعتماد مؤسسات تربوية خاصة /توسعة ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "دمج  تلميذ في  القسم الخاص بالتوحد",
              " تسوية وضعية تلميذ في ارضية الرقمنة ",
              "انشغالات نقاية التربية ",
              "السكنات الوظيفية ",
              "الإستخلاف",
              "الحركة التنقلية للأساتذة",
              "تسوية الوضعيات المهنية",
              "طللب الحصول على مقررة التكوين ",
              "شكوى ضد مدير ",
              "طلب الابقاء على معلمة في مكان عملها ",
              "عدم التقيد بمدونة الادوات المدرسية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["انجاز مؤسسات تربوية "],
          },
        ],
      },
      {
        name: " لجنة الخدمات الاجتماعية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["اعادة النظر في التعويضات الممنوحة في التقاعد "],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة التعليم العالي و البحث العلمي  ",
    institution: [
      {
        name: " المصالح المركزية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [" الإعتمادات  ", " معادلة الشهادات ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  الجامعة   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " التسجيل في الجامعة/ اعادة ادماج الطلبة  ",
              "احتساب نقاط طالب ناجح في الدورة العادية كناجح بالدورة الاستدراكية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  ديوان الخدمات الجامعية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " منحة الطالب",
              "النقل- الإطعام- الإيواء ",
              "تسوية الوضعيات مالية ",
              "تنفيذ الأحكام القضائية  ",
              "منحة التمدرس ( للمتقاعدين)",
              "السكن العمومي الموجه لقطاع الخدمات الاجتماعية ",
              "بيان  منظمة نقابية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["طلب توفير النقل لصالح الطلبة "],
          },
        ],
      },

      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة التكوين و التعلييم المهنيين ",
    institution: [
      {
        name: " مديرية التكوين والتعليم المهنيين  DFEP    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " اعتماد مدرسة خاصة للتكوين المهني  ",
              " تسوية الوضعيات مالية  ",
              "تنفيذ الأحكام القضائية ",
              "المسابقات والامتحانات الخاصة بالتوظيف",
              "طلب ترقية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["انجاز ملحقات ادارية "],
          },
        ],
      },

      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },

  {
    wizara: "   وزارة الشباب و الرياضة ",
    institution: [
      {
        name: " مديرية الشباب والرياضة",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "التماس اعفاء النوادي رياضة السباحة من مستحقات استغلال المسابح ",
              "طلب تحويل موظف ",
              "شكوى ضد رئيس رابطة رياضية ",
              "شكوى ضد مدير المركب الرياضي ",
              "طلب تسخير قاعة رياضية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["انجاز فضاءات رياضية"],
          },
        ],
      },

      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الثقافة و الفنون",
    institution: [
      {
        name: " مديرية الثقافة و الفنون",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "البطاقة المهنية ",
              "رخص التصوير",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              " تسوية وضعية ارض ملك خاص تم تصنيفها جزء من من منطقة آثرية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة البريد و المواصلات السلكية و اللآسلكية ",
    institution: [
      {
        name: " مديرية البريد و المواصلات السلكية و اللاسلكية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "دفتر الشيكات-الحسابات البريدية-البطاقة الذهبية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [
              "الربط بشبكة الهاتف الثابت",
              "الربط بشبكة الأنترنات",
              "انجاز مراكز بريد",
            ],
          },
        ],
      },

      {
        name: " بريد الجزائر ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " شكوى ضد  قابض بريد بسب المعاملة الغير الائقة للزبائن ",
              "طلب تنفيذ حكم قضائي",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة التضامن الوطني و الأسرة و قضايا المرأة ",
    institution: [
      {
        name: " مديرية النشاط الاجتماعي   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "منحة الإعاقة  (يتم أيضا إيداع الملفات على مستوى البلدية)",
              "طلب منحة الأشخاص المعوقين ",
              "بطاقة العلاج المجاني",
              "طلب الكفالة",
              "رخص دور الحضانة",
              "منحة ضحايا المأساة الوطنية",
              "طلب الاعانة العينية ( دراجة نارية ، كرسي متحرك....إلخ)",
              "الادماج الاجتماعي ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "  توفير مسلتزمات للمكفوفين تتمثل في عصى المكفوفين  وآلات التسجيل والساعات والناطقة",
              "طلب عمل ",
              "انشغالات فئة ذوي الاحتياجات الخاصة",
              " توفير  وسيلة نقل خاصة بجمعية للمعاقين ",
              "المنحة الجزافية لتضامن ",
              "طلب اعانة مالية ",
              "طلب اعانة مالية ",
              "طلب مساعدة لفئة ذوي الاحتياجات الخاصة ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الصناعة ",
    institution: [
      {
        name: " المصالح المركزية    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الإعتمادات",
              "رخصة نقل نشاط مصنع من الخارج",
              "رخصة لجمركة سلاسل الإنتاج المجددة",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  مديرية الصناعة    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "قطعة أرضية لإنجاز مشاريع استثمارية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "رخصة استغلال لمشروع استثماري",
              "عقد الامتياز لانجاز مشروع استثماري",
              "طلب دراسة ملف استثماري",
              "طلب اعادة النظر في دراسة ملفه الاستثماري لمؤسسة مصنفة ",
              "كراء مستودع بالمنطقة الصناعية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: " مجمع الصناعات المحلية-ديفانس- ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["كراء مستودع بالمنطقة الصناعية ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الفلاحة و التنمية الريفية   ",
    institution: [
      {
        name: " المصالح المركزية    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تنفيذ الأحكام القضائية ",
              "الدعم الفلاحي",
              "تزويد المربين بالشعير",
              "رخص استيراد المواد الأولية/الأبقار",
              "الاعتمادات الصحية ",
              "رخص نقل و تخزين المواد النباتية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "مديرية المصالح الفلاحية DSA ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الاستفادة من العقار الفلاحي",
              "الربط بالكهرباء الريفية",
              "تسوية الوضعية القانونية للعقارات الفلاحية",
              "رخصة حفر بئر عميق موجه للسقي",
              "الاعتمادات الصحية ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "بطاقة فلاح",
              "رفض مصالح الفلاحة جميع مخططات الرفع الطبوغرافية المنجزة من طرف الشاكين",
              "طلب اجراء معاينة ميدانية لمشروع استثماري",
              "طلب رفع التجميد عن مشروع لتوسعة مستثمرة فلاحية ",
              "طلب الدعم الفلاحي",
              "طلب إلتماس من أجل تخفيض سعر العتاد الفلاحي",
              "تسرب مياه الصرف الصحي الى ارض فلاحية",
              "طلب  الحصول على الة حصاد ",
              "طلب فتح تحقيق في مديرية المصالح الفلاحية DSA",
              "نهب عقار فلاحي ",
              " طلب تعويض عن قطعة أرض ",
              "معارضة لانشاء محيط فلاحي ",
              "الاعتداء على ارض فلاحية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: " الديوان الوطني للأراضي الفلاحية  ONTA ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تحويل حق الانتفاع الدائم إلى حق الامتياز",
              "اعتراض منح جزء من ملكية خاصة بعقد امتياز ",
              "عقد الامتياز للاراضي الفلاحية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  محافظة الغابات  C.Forets  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخص استغلال الأراضي الغابية",
              "التعويض عن حرائق الغابات",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "السكنات الوظيفية ",
              "طلب عمل",
              "اقصاء من منحة الخدمات الاجتماعية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " OAIC  الديوان الجزائري المهني للحبوب ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " اعادة النظر في تسعيرة نقل الحبوب  والبقول الجافة",
              "التماس اعادة النظر فسخ اتفاقية خاصة بالنقل",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " الغرفة الفلاحية C.A ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["بطاقة الفلاح ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مدير مؤسسة العتاد الفلاحي  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["طلب عتاد فلاحي ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "  وزارة السكن والعمران والمدينة ",
    institution: [
      {
        name: " مديرية السكن",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "اعتماد نشاط مرقي عقاري ",
              "شهادة التأهيل والتصنيف المهنيين",
              "اعتماد نشاط وكيل عقاري",
              "اعتماد نشاط مهندس (الهندسة المدنية)",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "طلب معاينة شقة لتاكد من مطابقة الموصفات مع دفتر الشروط ببرنامج الترقوي المدعم ",
              "عدم تطابق المعلومات الموجودة بالبطاقة التقنية للمشروع مع المعلومات البيان الوصفي",
              "تجميد الاستفادة من قطعة ارض صالحة للبناء",
              "البطاقة الوطنية للسكن",
              "طلب تحويل موظف ",
              "طلب تدخل للانطلاق في مشروع السكن الترقوي المدعم",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [
              "اعادة ترقيم العمارات حسب مخطط الكتلة",
              "التجاوزات والخروقات من طرف المرقي العقاري",
              "اخرى",
            ],
          },
        ],
      },
      {
        name: "مديرية التعمير والهندسة المعمارية والبناء",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "شهادة المطابقة لانجاز مشروع استثماري",
              "تحرير مخالفة ( محضر تعدي)",
              "رخصة البناء ( 200 وحدة سكنية  فأكثر)",
              "رخصة البناء ( مشروع إستثماري)",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "عدم الامضاء عقود دراسة على مستوى مديرية التعمير",
              "تهيئة منطقة النشاطات والتخزين",
              "طلب تدخل لعدم مطابقة القطعة لدفتر الشروط",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["التهيئة الحضرية ", "أخرى"],
          },
        ],
      },

      {
        name: " مديرية التجهيزات العمومي ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تعويض عن نزع الملكية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "تسوية المستحقات المالية لمخابر الدرسات ",
              "تسوية عقود الدراسات ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " ديوان الترقية والتسيير العقاري ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              " التنازل عن السكانات العمومية الإيجارية التابعة  للديوان",
              "نقل حق الإيجار",
              "صيانة وتهيئة المساحات المشتركة للعمارات",
              "تسوية وضعية المحلات",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "تغير السكنات العمومية التابعة للديوان ",
              "تسوية وضعية شقة لم يتم العثور على ملفها القاعدي",
              "تسوية نزاع قضائي",
              "انجاز فرع اداري",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " الصندوق الوطني للسكن ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "اعانة الدولة ( السكن الريفي، LPA،.....)",
              "البطاقية الوطنية للسكن",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " وكالة عدل ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "تسوية وضعية المساكن واعداد عقود الملكية",
              "صيانة وتهيئة المساحات المشتركة للعمارات",
              "تسوية وضعية المحلات",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة التجارة وترقية الصادرات  ",
    institution: [
      {
        name: " المصالح المركزية    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الإعتمادات",
              "رخص الإستيراد",
              "رخص مزاولة النشاطات التجارية والمهن المقننة",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "التموين بالمواد الغذائية الأساسية",
              "فتح نقطة بيع غاز البوتان ",
              "اعاة النظر في غلق محل ",
              "تسوية وضعية مهنية",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["انشاء سوق جوارية ", "أخرى"],
          },
        ],
      },
      {
        name: "  مديرية التجارة و ترقية الصادرات     ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخص البيع (بالتخفيض-الترويجي)",
              "رخصة استغلال مخبر النوعية",
              "رخص الإنتاج",
              "رخصة التصدير",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },

      {
        name: " المركز الوطني للسجل التجاري ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["استصدار السجل التجاري", "شطب من السجل التجاري ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " غرفة التجارة والصناعة  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["طلب تثمين شهادة ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الأشغال العمومية والمنشآت القاعدية     ",
    institution: [
      {
        name: " مديرية الأشغال العمومية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "التعويض عن نزع الملكية لإنجاز مشروع في إطار المنفعة العمومية",
              "شهادات التأهيل والتصنيف المهنيين",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "الاعتداء على ملكية خاصة ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["تعبيد الطرقات", "الترخيص الربط بشبكة الكهرباء", "أخرى"],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة الري",
    institution: [
      {
        name: " مديرية الموارد المائية    ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخصة استعمال الموارد المائية",
              "تعويض عن نزع الملكية",
              "شهادات التأهيل والتصنيف المهنيين",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "الغاء صفقة عمومية",
              "طلب تمديد رخصة امتياز لاستخراج مقلع الرمل ",
              "تسوية وضعيات مالية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [
              "التزود بالمياه الصالحة للشرب ",
              "الربط بقنوات الصرف الصحي ",
              "ترميم سد",
              "انجاز سد",
              "اخرى",
            ],
          },
        ],
      },
      {
        name: " الجزائرية للمياه (SEAL/SEAOR/SEACO) ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الربط بشبكة المياه الصالحة للشرب",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " الديوان الوطني للتطهير(ONA) ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الربط بقنواة الصرف الصحي ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  الديوان الوطني للسقي و صرف المياه  ONID  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["شكوى لعدم التزود بمياه السقي ", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة النقل",
    institution: [
      {
        name: " المصالح المركزية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["الإعتمادات", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية النقل ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "خطوط النقل البرية",
              "رخص السير ",
              "اعتماد (مدارس السياقة-ممرن سياقة – وكالة المراقبة التقنية)              ",
              "اعتماد مرشد بحري",
              "رخص النقل البحري",
              "دفتر المقاعد",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "اعادة النظر في تحويل مكان توقف سيارات الاجرة ",
              "شكوى ضد سائق حافلة",
              "شكوى ضد مدير النقل ",
              "طلب فتح تحقيق في نقابة ",
              "طلب فتح تحقيق في مديرية النقل ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["ادخال محطة نقل المسافرين حيز الخدمة", "أخرى"],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة السياحة والصناعة التقليدية ",
    institution: [
      {
        name: " المصالح المركزية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["الإعتمادات", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية السياحة والصناعة التقليدية  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "شهادة تصنيف الحرفيين",
              "رخصة مزاولة الانشطة الفندقية والسياحية",
              "شهادة تصنيف الفنادق السياحة ",
              "رخصة استغلال المياه الحموية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة الصحة",
    institution: [
      {
        name: " مديرية الصحة  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "اعتماد فتح صيدلية خاصة",
              "اعتماد عيادة خاصة",
              "تحويل مقر صيدلية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              " التنازل عن صيدلية",
              "طلبات تحويل الموظقين",
              "طلب التكفل  بمرضى القصور الكلوي بنقلهم الى مقرات سكناهم",
              "اقصاء طبيب من تربص خاص بالاشعة",
              "طعن في مسابقة توظيف ",
              "طلب  عمل ",
              "شكوى ضد مدير المؤسسة العمومية لصحة الجوارية ",
              "طلب التكفل بالانشغالات  مرضى القصور الكلوي",
              "اعادة لافته تحمل شهيد",
              "تسوية وضعيات مهنية",
              "طلب تعويض ",
              "تبليغ عن فساد ",
              "سرقة طفل من عيادة",
              "عدم توفر الاطباء الاختصاصيين",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: ["انجاز مرافق صحية مجاورة "],
          },
        ],
      },
      {
        name: " المعهد الوطني العالي للتكوين الشبه طبي  ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "المعهد الوطني العالي للتكوين الشبه طبي ",
              "منحة الدراسة",
              "اخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة العمل والتشغيل والضمان الاجتماعي ",
    institution: [
      {
        name: " الصندوق الوطني التقاعد   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["منحة التقاعد", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " الوكالة الولائية للتشغيل ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["التشغيل وعروض العمل", "منحة البطالة", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " صندوق التأمين عن البطالة ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "التعويض عن البطالة للعمال الاجراء ",
              "دعم احداث وتوسيع النشاط لفائدة البطالين  ذوي المشاريع ( 35-50 سنة)   ",
              "شكوى ضد رئيس مصلحة ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " صندوق الضمان الاجتماعي للعمال الاجراء ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "بطاقة الشفاء",
              "التعويضات عن العطل المرضية",
              "المراقبة الصحية",
              "تحديد نسبة الإعاقة والعجز",
              "تسوية وضعية مهنية ",
              "شكوى ضد موظف",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " صندوق الضمان الاجتماعي للعمال غير الاجراء ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "بطاقة الشفاء",
              "التعويضات المادية",
              "المراقبة الصحية",
              "طلب الاعفاء من المبلغ المستحق لدى الصندوق",
              " طلب اعادة النظر في تقرير المراقبة المالية لاعادة تقييم وعاء الاشتراك ",
              "طلب شهادة عدم الانتساب",
              "شكو ضد مدير صندوق الضمان الاجتماعي للعمال غير الاجراء",
              "عدم احتساب سنوات العمل في معاش التقاعد ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " صندوق العطل المدفوعة الاجر والبطالة الناجمة عن سوء الأحوال الجوية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الاستفادة من تعويض البطالة بسبب سوء الأحوال الجوية  ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " صندوق معادلة الخدمات الاجتماعية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الاعانة المالية المتبقية لاكتساب سكن اجتماعي تساهمي أو سكن ترقوي مدعم من طرف الدولة",
              "إنجاز مسكن في إطار برنامج البناء الريفي",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية التشغيل ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الادماج المهني",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "طلب عمل ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مفتشية العمل ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["شكاوى العمال", "عدم تنفيذ الاحكام القضائية.", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: " وزارة البيئة والطاقات المتجددة ",
    institution: [
      {
        name: " المصالح المركزية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["رخص جمع و نقل النفايات الصناعية و الطبية", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " مديرية البيئة و الطاقات المتجددة ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخص جمع و نقل النفايات الصناعية و الطبية",
              "رخصة الاستغلال لمشروع استثماري",
              "الترخيص المسبق لإنشاء مؤسسة مصنفة ",
              "مقررات التأثير على البيئة ",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "طلب الغاء مشروع منشأة الردم التقني ",
              " حماية البيئة من خطر التصحر",
              "تحويل محولات كهربائية  على البيئة",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة الصيد البحري والمنتجات الصيدية",
    institution: [
      {
        name: " المصالح المركزية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: ["رخص اقتناء سفينة (صيد او نزهة)", "أخرى"],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "مديرية الصيد البحري والمنتجات الصيدية ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخصة الصيد البحري",
              "رخصة انشاء مؤسسة تربية المائيات",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة الصناعة الصيدلانية",
    institution: [
      {
        name: " المصالح المركزية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "رخص تصدير الأدوية والمستلزمات الطبية",
              "رخص تسجيل و تسويق الأدوية والمستلزمات الطبية",
              "رخص استيراد الأدويىة والمستلزمات الطبية",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
  {
    wizara: "وزارة  إقتصاد المعرفة والمؤسسات الناشئة والمؤسسات المصغرة  ",
    institution: [
      {
        name: " المصالح المركزية   ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "أخرى",
              "الحصول على علامة: مشروع مبتكر,مؤسسة ناشئة,",
              "تمويل المؤسسات الناشئة",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: "  الوكالة الوطنية لد عـم و تنمية المقاولاتية ANADE ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "انشاء و تمويل المؤسسات المصغرة",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " وكالة تسيير القرض المصغر ANGEM ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [
              "الاستفادة من قرض",
              "تسوية الوضعيات مالية",
              "تنفيذ الأحكام القضائية ",
              "أخرى",
            ],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
      {
        name: " أخرى ",
        mawdo3: [
          {
            naw3arida: "شخص طبيعي",
            mawdo3s: [],
          },
          {
            naw3arida: "خدمة عمومية",
            mawdo3s: [],
          },
        ],
      },
    ],
  },
];

const dairaData: DairaType[] = [
  {
    name: "المسيلة",
    baladiya: ["المسيلة"],
  },
  {
    name: "بوسعادة",
    baladiya: ["بوسعادة", "الهامل", "ولتام"],
  },
  {
    name: "أولاد دراج",
    baladiya: [
      "أولاد دراج",
      "أولاد عدي القبالة",
      "المطارفة",
      "المعاضيد",
      "السوامع",
    ],
  },
  {
    name: "الخبانة",
    baladiya: ["الخبانة", "مسيف", "الحوامد"],
  },
  {
    name: "الشلال",
    baladiya: ["الشلال", "أولاد ماضي", " خطوطي سد الجير", "المعاريف"],
  },
  {
    name: "بن سرور",
    baladiya: ["بن سرور", "أولاد سليمان", "الزرزور", "محمد بوضياف"],
  },
  {
    name: "عين الملح",
    baladiya: [
      "عين الملح",
      "بير فضة",
      "عين فارس",
      "تامور سيدي محمد",
      "عين الريش",
    ],
  },
  {
    name: "امجدل",
    baladiya: ["امجدل", "أولاد عطية"],
  },
  {
    name: "جبل مساعد",
    baladiya: ["جبل مساعد", "سليم"],
  },
  {
    name: "مقرة",
    baladiya: ["مقرة", "برهوم", "عين خضرة", " بلعايبة ", "الدهاهنة"],
  },
  {
    name: "سيدي عيسى",
    baladiya: ["سيدي عيسى", "وطي السايح", "بني يلمان"],
  },
  {
    name: "عين الحجل",
    baladiya: ["عين الحجل", "سيدي هجرس"],
  },
  {
    name: "حمام الضلعة",
    baladiya: ["حمام الضلعة", " تارمونت", "أولاد منصور", "ونوغة"],
  },
  {
    name: "سيدي عامر",
    baladiya: ["سيدي عامر", "تامسة"],
  },
  {
    name: "أولاد سيدي إبراهيم",
    baladiya: ["أولاد سيدي إبراهيم", "بنزوه"],
  },
];
type Sifat = {
  name: string;
  association: string[];
};
const SifatData: Sifat[] = [
  {
    name: "مواطن",
    association: [],
  },
  {
    name: "مؤسسة",
    association: [],
  },
  {
    name: "جمعية",
    association: [
      "جمعية بلدية ",
      "جمعية حي",
      "جمعية وطنية",
      "جمعية ولائية",
      "مجموعة مواطنين",
      "ممثل قرية",
    ],
  },
];
const directionData: string[] = [
  "مديرية الصحة",
  "مديرية السكن",
  "مديرية الري",
  "مديرية التربية و التعليم",
  "مديرية الصناعة",
  "مديرية الفلاحة",
  "مديرية الشغل",
  "مديرية التعليم العالي",
  "مديرية التكوين المهني",
  "مديرية الاشغال العمومية",
  "مديرية البناء و التعمير",
  "مديرية النقل",
  "مديرية الشؤون الدينية",
  "مديرية الطاقة",
  "مديرية التجارة",
  "مديرية محافظة الغابات",
  "مديرية المجاهدين",
  "مديرية السياحة",
  "مديرية الثقافة",
  "مديرية البرمجة و متابعة الميزانية",
  "مديرية الحماية المدنية",
  "مديرية الضرائب",
  " مديرية الشباب و الرياضة",
  "مديرية التجهيزات العمومية",
  "ديوان الترقية و التيير العقاري",
];

const sectoreData: string[] = ["دائرة", "مديرية", "خارج اختصاص", "اخرى"];
const source = [
  "BOG",
  "Cabinet",
  "FAX",
  "MAIL",
  "Réseaux Sociaux",
  "WEB",
  "Audience",
];

const receptionType = z.object({
  fullName: z.string().min(2),
  date: z.coerce.date(),
  docNumber: z.string().optional(),
  grades: z.string().trim().min(1),
  gradesType: z.string().optional(),
  town: z.string().trim().min(1),
  city: z.string().trim().min(1),
  note: z.string().optional(),
  petitionHasFiled: z.boolean(),
  sector: z.string().optional(),
  unstutation: z.string().optional(),
  subject: z.string().optional(),
  ministry: z.string().trim().min(1),
  typePlaint: z.string().optional(),
  subjectPlaint: z.string().optional(),
});
const tasksTypeSchema = z.object({
  createdBy: z.string(),
  users: z.array(z.string()).min(1),
  title: z.string(),
  description: z.string().nullable().optional(),
  finishedAt: z.date().nullable().optional(),
  status: z.enum(["pending", "complete", "processing"]),
});
const plainteType = z.object({
  fullName: z.string().min(2),
  city: z.string().trim().min(1),
  town: z.string().trim().min(1),
  ministry: z.string().trim().min(1),
  unstutation: z.string().optional(),
  typePlaint: z.string().optional(),
  subjectPlaint: z.string().optional(),
  grades: z.string().trim().min(1),
  gradesType: z.string(),
  sourcePlaint: z.string().optional(),
  correspondenceNumber: z.string(),
  correspondenceDate: z.coerce.date(),
  filesRelated: z.string().optional(),
  recipients: z.array(
    z.object({
      sector: z.string().optional(),
      reciption: z.string().optional(),
      town: z.string().optional(),
      save: z.boolean().optional(),
    })
  ),
});

export {
  receptionType,
  plainteType,
  WissataTypeSchemadata,
  dairaData,
  SifatData,
  source,
  sectoreData,
  directionData,
};
